packages/correos/correos-0.0.6.tar.gz/correos-0.0.6/correos/template/oficinas.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.mauo.correos.es">
    <soapenv:Header/>
    <soapenv:Body>
        <ejb:localizadorConsulta>
            <ejb:codigoPostal>${zip}</ejb:codigoPostal>
        </ejb:localizadorConsulta>
    </soapenv:Body>
</soapenv:Envelope>
