target/test-classes/Payloads/localizadorConsulta.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ejb="http://ejb.mauo.correos.es">
   <soapenv:Header/>
   <soapenv:Body>
      <ejb:localizadorConsulta>
         <ejb:codigoPostal>28040</ejb:codigoPostal>
      </ejb:localizadorConsulta>
   </soapenv:Body>
</soapenv:Envelope>